Table of Contents
 Class PointOnLine3D
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Represents a Point dependent on the line in three-dimensional space.
[OpenModelClass("CI.Geometry3D.PointOnLine3D,CI.Geometry3D", "CI.Geometry3D.IPointOnLine3D,CI.BasicTypes")]
public class PointOnLine3D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
PointOnLine3D
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Geometry
Gets or sets the reference to PolyLine3D line or Segment3D segment.
public ReferenceElement Geometry { get; set; }
Property Value
ReferenceElement
 IsFromStart
Gets or sets the position value is measured from the start or the ent of the line.
public bool IsFromStart { get; set; }
Property Value
bool
 IsRelative
Gets or sets absolute or relative representation of the position value.
public bool IsRelative { get; set; }
Property Value
bool
 Position
Gets or sets the position value on the line.
public double Position { get; set; }
Property Value
double
 Edit this page